# **Handling date and time**

In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv("../files/orders.csv")
time = pd.read_csv("../files/messages.csv")

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
date.dtypes, time.dtypes

(date          object
 product_id     int64
 city_id        int64
 orders         int64
 dtype: object,
 date    object
 msg     object
 dtype: object)

In [5]:
# converting into datetime format
date["date"] = pd.to_datetime(date["date"])
date.dtypes

date          datetime64[ns]
product_id             int64
city_id                int64
orders                 int64
dtype: object

**1. Extract year, month and day**

In [12]:
date["date_year"] = date["date"].dt.year
date["date_month"] = date["date"].dt.month
date["date_month_name"] = date["date"].dt.month_name()
date['date_day'] = date['date'].dt.day
date['date_day_name'] = date['date'].dt.day_name()

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_day_name
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday

In [13]:
import datetime

In [15]:
today = datetime.datetime.today()
today

datetime.datetime(2025, 2, 4, 22, 45, 31, 754236)

In [20]:
(today - date['date']).dt.days

0      1883
1      2365
2      2296
3      1998
4      2221
       ...
995    2311
996    2252
997    2100
998    2165
999    1939
Name: date, Length: 1000, dtype: int64

In [24]:
# months passed

np.round((today - date["date"]) / np.timedelta64(30, "D"), 0)

0      63.0
1      79.0
2      77.0
3      67.0
4      74.0
       ...
995    77.0
996    75.0
997    70.0
998    72.0
999    65.0
Name: date, Length: 1000, dtype: float64

In [30]:
time['date'] = pd.to_datetime(time['date'])

In [28]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [33]:
time["time"] = time["date"].dt.time
time["hour"] = time["date"].dt.hour
time["minute"] = time["date"].dt.minute
time["second"] = time["date"].dt.second

time.head()

,date,msg,hour,minute,second,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00